olliw42/stm32ll-lib/stdstm32-uart-template.h
#elif defined UART$_USE_UART6 || defined UART$_USE_UART6_PG14PG9
  #define UART$_UARTx             USART6
  #ifdef UART$_USE_UART6
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART6_PC6PC7
    #define UART$_TX_IO           IO_PC6
    #define UART$_RX_IO           IO_PC7
  #elif defined UART$_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UART$_TX_IO           IO_PG14
    #define UART$_RX_IO           IO_PG9
  #endif
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              USART6_IRQn
  #define UART$_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_UART7 || defined UART$_USE_UART7_PE8PE7 || defined UART$_USE_UART7_PF7PF6
  #define UART$_UARTx             UART7
  #ifdef UART$_USE_UART7
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART7_PE8PE7
    #define UART$_TX_IO           IO_PE8
    #define UART$_RX_IO           IO_PE7
  #elif defined UART$_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UART$_TX_IO           IO_PF7
    #define UART$_RX_IO           IO_PF6
  #endif
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              UART7_IRQn
  #define UART$_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_UART8 || defined UART$_USE_UART8_PE1PE0
  #define UART$_UARTx             UART8
  #ifdef UART$_USE_UART8
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART8_PE1PE0
    #define UART$_TX_IO           IO_PE1
    #define UART$_RX_IO           IO_PE0
  #endif
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              UART8_IRQn
  #define UART$_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_LPUART1 || defined UART$_USE_LPUART1_PA2PA3 || defined UART$_USE_LPUART1_PC1PC0
  #define UART$_UARTx             LPUART1
  #ifdef UART$_USE_LPUART1
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_LPUART1_PA2PA3
    #define UART$_TX_IO           IO_PA2
    #define UART$_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UART$_IO_AF         IO_AF_12 // G4
    #else
      #define UART$_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UART$_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UART$_TX_IO           IO_PC1
    #define UART$_RX_IO           IO_PC0
    #define UART$_IO_AF           IO_AF_8
  #endif
  #define UART$_IRQn              LPUART1_IRQn
  #define UART$_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #endif

#else
  #error No UART$_USE_UARTx defined!
#endif


// allows us to overwrite the default pin assignment
#ifdef UART$_USE_TX_IO
  #undef UART$_TX_IO
  #define UART$_TX_IO             UART$_USE_TX_IO
#endif
#ifdef UART$_USE_RX_IO
  #undef UART$_RX_IO
  #define UART$_RX_IO             UART$_USE_RX_IO
#endif
#ifdef UART$_USE_IO_AF
  #undef UART$_IO_AF
  #define UART$_IO_AF             UART$_USE_IO_AF
#endif


// catch missing defines, compiler will throw error anyhow, but so it is nicer
#if defined UART_USE_TX && !defined UART$_TX_IO
  #error No UART$ TX IO defined!
#endif
#if defined UART_USE_RX && !defined UART$_RX_IO
  #error No UART$ RX IO defined!
#endif
#if !defined UART$_IO_AF
  #error No UART$ IO AF defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Note: LPUART does not appear to have STOPBITS_0_5 and STOPBITS_1_5!!
//
// The LL_USART_xx() and LL_LPUART_xx() functions which only relate to flags or
// registers can be used for both USART and LPUART.
// Below we simply use the LL_USART_xx() functions for both.
// Notably, this appears to be incorrect for the init struct functions, which hence
// need special treatment.

#if defined UART$_USE_LPUART1 || defined UART$_USE_LPUART1_PA2PA3 || defined UART$_USE_LPUART1_PC1PC0
#if !(LL_USART_PARITY_NONE == LL_LPUART_PARITY_NONE) || !(LL_USART_PARITY_EVEN == LL_LPUART_PARITY_EVEN) || \
    !(LL_USART_PARITY_ODD == LL_LPUART_PARITY_ODD) || \
    !(LL_USART_STOPBITS_1 == LL_LPUART_STOPBITS_1) || !(LL_USART_STOPBITS_2 == LL_LPUART_STOPBITS_2)
  //#error Missmatch of LL_USART and L_LPUART flags!
#endif
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
  #define FLAG_SR_IDLE  LL_USART_SR_IDLE
#elif defined STM32F3 || defined STM32F7 || defined STM32L4 || defined STM32F0
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#elif defined STM32G4 || defined STM32WL
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#endif

#if defined STM32F3 || defined STM32F7 || defined STM32F0
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#elif defined STM32G4 || defined STM32L4 || defined STM32WL
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UART$_USE_RX || defined UART$_USE_TX_ISR

void UART$_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UART$_UARTx, REG_SR); // read USART_SR register

